import random
a=[1, 2, 3, 4, 5, 6, 7, 8, 9]
b=0
while b<9:
    print("", a[0], "|", a[1], "|", a[2], "\n", "—", "+", "—", "+", "—", "\n", a[3], "|", a[4], "|", a[5], "\n", "—", "+", "—", "+", "—", "\n", a[6], "|", a[7], "|", a[8])
    d=0
    while d<1:
        e=0
        while e<1:
            c=int(input("Введите число, за место которого поставите X: "))
            if c<1 or c>9:
                print("Нет такого числа.")
            else:
                e+=1
        c-=1
        if a[c]=="X" or a[c]=="O":
            print("Занято.")
        else:
            a[c]="X"
            d+=1
    if a[0]==a[1]==a[2] or a[3]==a[4]==a[5] or a[6]==a[7]==a[8] or a[0]==a[3]==a[6] or a[1]==a[4]==a[7] or a[2]==a[5]==a[8] or a[0]==a[4]==a[8] or a[6]==a[4]==a[2]:
        print("", a[0], "|", a[1], "|", a[2], "\n", "—", "+", "—", "+", "—", "\n", a[3], "|", a[4], "|", a[5], "\n", "—", "+", "—", "+", "—", "\n", a[6], "|", a[7], "|", a[8])
        print("Вы победили.")
        b=9
    else:
        if b==8:
            b+=1
            print("", a[0], "|", a[1], "|", a[2], "\n", "—", "+", "—", "+", "—", "\n", a[3], "|", a[4], "|", a[5], "\n", "—", "+", "—", "+", "—", "\n", a[6], "|", a[7], "|", a[8])
            print("Ничья.")
        else:
            b+=1
            print("", a[0], "|", a[1], "|", a[2], "\n", "—", "+", "—", "+", "—", "\n", a[3], "|", a[4], "|", a[5], "\n", "—", "+", "—", "+", "—", "\n", a[6], "|", a[7], "|", a[8])
            print("Бот сходил.")
            d=0
            while d<1:
                c=random.randint(1, 9)
                c-=1
                if a[c]=="X" or a[c]=="O":
                    d=0
                else:
                    a[c]="O"
                    d+=1
            if a[0]==a[1]==a[2] or a[3]==a[4]==a[5] or a[6]==a[7]==a[8] or a[0]==a[3]==a[6] or a[1]==a[4]==a[7] or a[2]==a[5]==a[8] or a[0]==a[4]==a[8] or a[6]==a[4]==a[2]:
                print("", a[0], "|", a[1], "|", a[2], "\n", "—", "+", "—", "+", "—", "\n", a[3], "|", a[4], "|", a[5], "\n", "—", "+", "—", "+", "—", "\n", a[6], "|", a[7], "|", a[8])
                print("Вы проиграли.")
                b=9
            else:
                b+=1